let list = {
  data:{
    list:[{
      "tagName": "情感生活",
      "list": [{
          "id": 39104,
          "name": "全部专辑"
        },{
          "id": 39105,
          "name": "情感治愈"
        },{
          "id": 109,
          "name": "晚安心语"
        },{
          "id": 39106,
          "name": "美文故事"
        },{
          "id": 38983,
          "name": "恋爱宝典"
        },{
          "id": 107,
          "name": "两性夜话"
        },{
          "id": 108,
          "name": "旅行人文"
        }]
    },{
        "tagName": "音乐电台",
        "list": [{
          "id": 39110, 
          "name": "全部专辑"
        },{
          "id": 102, "name": "心情"
        },{
          "id": 118, "name": "乐评"
        },{
          "id": 117, "name": "歌手"
        },{
          "id": 38936, "name": "流行"
        },{
          "id": 39116, "name": "经典"
        },{
          "id": 40083, "name": "催眠"
        },{
          "id": 38937, "name": "欧美"
        },{
          "id": 40078, "name": "日韩"
        },{
          "id": 101, "name": "榜单"
        },{
          "id": 40038, "name": "粤语"
        },{
          "id": 103, "name": "纯音"
        },{
          "id": 100, "name": "3D"
        },{
          "id": 40030, "name": "电子"
        },{
          "id": 40029, "name": "喊麦"
        },{
          "id": 40082, "name": "原创"
        },{
          "id": 38938, "name": "翻唱"
        },{
          "id": 38943, "name": "民谣"
        },{
          "id": 40079, "name": "摇滚"
        },{
          "id": 40028, "name": "动漫"
        },{
          "id": 40080, "name": "古风"
        },{
          "id": 40081, "name": "宗教"
        },{
          "id": 40077, "name": "跑步"
        },{
          "id": 38942, "name": "影视"
        },{
          "id": 40039, "name": "古典"
        },{
          "id": 40036, "name": "世界"
        },{
          "id": 40037, "name": "儿童"
        }]
    },{
        "tagName": "有声小说",
        "list": [{
          "id": 39092, "name": "全部专辑"
        },{
          "id": 41092, "name": "悬疑推理"
        },{
          "id": 39096, "name": "恐怖灵异"
        },{
          "id": 38954, "name": "玄幻奇幻"
        },{
          "id": 38949, "name": "现代言情"
        },{
          "id": 38951, "name": "古代言情"
        },{
          "id": 105, "name": "鬼故事"
        },{
          "id": 104, "name": "影视原著"
        },{
          "id": 40042, "name": "网游竞技"
        },{
          "id": 38953, "name": "都市生活"
        },{
          "id": 38958, "name": "武侠传奇"
        },{
          "id": 38957, "name": "官场商战"
        },{
          "id": 38960, "name": "历史军事"
        },{
          "id": 38959, "name": "青春校园"
        },{
          "id": 40041, "name": "耽美同人"
        },{
          "id": 39103, "name": "广播剧"
        },{
          "id": 40040, "name": "社科管理"
        },{
          "id": 38956, "name": "文学名著"
        },{
          "id": 41093, "name": "杂志专栏"
        }]
    },{
        "tagName": "相声曲艺",
        "list": [{
          "id": 4, "name": "全部专辑"
        },{
          "id": 38963, "name": "郭德纲"
        },{
          "id": 39109, "name": "相声新星"
        },{
          "id": 38971, "name": "相声名家"
        },{
          "id": 38969, "name": "评书大全"
        },{
          "id": 38970, "name": "小品大全"
        },{
          "id": 111, "name": "粤语评书"
        },{
          "id": 40048, "name": "刘兰芳"
        },{
          "id": 40049, "name": "王玥波"
        },{
          "id": 38965, "name": "单田芳"
        },{
          "id": 38966, "name": "袁阔成"
        },{
          "id": 38972, "name": "田连元"
        },{
          "id": 39133, "name": "戏曲名剧"
        }]
    },{
        "tagName": "综艺娱乐",
        "list": [{
          "id": 1, "name": "全部专辑"
        },
        {
          "id": 38985, "name": "影视精选"
        },
        {
          "id": 38974, "name": "热门综艺"
        },
        {
          "id": 38982, "name": "八卦娱乐"
        },
        {
          "id": 113, "name": "星座风水"
        },
        {
          "id": 38980, "name": "明星专区"
        },
        {
          "id": 116, "name": "游戏动漫"
        },
        {
          "id": 40043, "name": "文娱杂谈"
        },
        {
          "id": 40045, "name": "时尚生活"
        },
        {
          "id": 40044, "name": "影视原声"
        }]
    },{
        "tagName": "妈咪宝贝",
        "list": [{
          "id": 39120, "name": "全部专辑"
        },
        {
          "id": 40005, "name": "睡前故事"
        },
        {
          "id": 40002, "name": "童话寓言"
        },
        {
          "id": 40001, "name": "儿歌音乐"
        },
        {
          "id": 40003, "name": "孕妈育儿"
        },
        {
          "id": 40009, "name": "经典名著"
        },
        {
          "id": 40070, "name": "诗词国学"
        },
        {
          "id": 40007, "name": "儿童英语"
        },
        {
          "id": 40008, "name": "儿童科普"
        },
        {
          "id": 40076, "name": "儿童教材"
        },
        {
          "id": 40004, "name": "卡通动画"
        }]
    },{
        "tagName": "知识干货",
        "list": [
          {
            "id": 39126, "name": "全部专辑"
          },
          {
            "id": 40014, "name": "科普充电"
          },
          {
            "id": 40072, "name": "名人专栏"
          },
          {
            "id": 40073, "name": "情商心理"
          },
          {
            "id": 39127, "name": "语言学习"
          },
          {
            "id": 114, "name": "考试教材"
          },
          {
            "id": 40060, "name": "职场提升"
          },
          {
            "id": 40071, "name": "互联网"
          },
          {
            "id": 39012, "name": "公开课演讲"
          },
          {
            "id": 39131, "name": "健康养生"
          },
          {
            "id": 39129, "name": "创业投资"
          }
        ]
    }, {
        "tagName": "历史人文",
        "list": [
          {
            "id": 18, "name": "全部专辑"
          },
          {
            "id": 40055, "name": "野史趣闻"
          },
          {
            "id": 40075, "name": "佛学修身"
          },
          {
            "id": 39132, "name": "传奇档案"
          },
          {
            "id": 39134, "name": "文化讲坛"
          },
          {
            "id": 40054, "name": "人物传纪"
          },
          {
            "id": 40050, "name": "中国历史"
          },
          {
            "id": 40062, "name": "世界历史"
          },
          {
            "id": 40052, "name": "军事战争"
          },
          {
            "id": 40074, "name": "人文艺术"
          }
        ]
    }, {
        "tagName": "新闻资讯",
        "list": [
          {
            "id": 5, "name": "全部专辑"
          },
          {
            "id": 38924, "name": "头条新闻"
          },
          {
            "id": 38925, "name": "深度观点"
          },
          {
            "id": 39078, "name": "社会百态"
          },
          {
            "id": 39049, "name": "商业财经"
          },
          {
            "id": 38927, "name": "IT科技"
          },
          {
            "id": 38931, "name": "军事要闻"
          },
          {
            "id": 110, "name": "自媒体"
          },
          {
            "id": 38929, "name": "汽车"
          },
          {
            "id": 38930, "name": "体育"
          }
        ]
    }, {
        "tagName": "搞笑段子",
        "list": [
          {
            "id": 39087, "name": "全部专辑"
          },
          {
            "id": 38976, "name": "热点趣闻"
          },
          {
            "id": 38979, "name": "糗事百科"
          },
          {
            "id": 106, "name": "内涵段子"
          },
          {
            "id": 40015, "name": "聊江湖"
          },
          {
            "id": 38978, "name": "冷笑话"
          },
          {
            "id": 38977, "name": "方言秀"
          }
        ]
    }, {
        "tagName": "广播电台",
        "list": [{
          "id": 39137, "name": "全部专辑"
        }]
    }]
  }
}

let api = 'https://api.imjad.cn/qqfm/v1/?';

function ctDetail(obj,suc){
  wx.request({
    url: api+obj,
    method:'get',
    success:suc
  })
}

module.exports={
  list,
  ctDetail: ctDetail
}
